{
  "units": [
    {
      "name": "Introduction",
      "content": [
        {
          "type": "list",
          "items": [
            "Overview of the schedule",
            "Setup of development environment",
            "High-level introduction to HTML and CSS",
            "High-level introduction to Git and Github",
            "Brief overview of how the web works (servers, clients, etc.)"
          ]
        }
      ]
    },
    {
      "name": "HTML",
      "content": [
        {
          "type": "list",
          "items": [
            "Brief history of HTML",
            "Introduction to HTML's role, structure vs. presentation",
            "Understanding what is meant by HTML5",
            "Using HTML semantic tags to create meaningful documents",
            "Understanding of images, differences between the various image formats"
          ]
        }
      ]
    },
    {
      "name": "CSS",
      "content": [
        {
          "type": "list",
          "items": [
            "Introduction to CSS' role, structure vs. presentation",
            "Experimenting with basic CSS properties",
            "Understanding of the CSS cascade and specificity",
            "Understanding of the CSS box model",
            "Use a browser's inspector to interact with the content",
            "Use media queries to create a responsive experience"
          ]
        }
      ]
    },
    {
      "name": "Javascript",
      "content": [
        {
          "type": "list",
          "items": [
            "Explain the use of Javascript in front-end development",
            "High-level understanding of imperative vs. declarative coding",
            "Javascript language: variables, data types, control flow, functions",
            "Introduction to the DOM and its manipulation",
            "Using jQuery for smoother DOM manipulations"
          ]
        }
      ]
    },
    {
      "name": "Responsive Framework: Foundation",
      "content": [
        {
          "type": "list",
          "items": [
            "High-level discussion about responsiveness",
            "Using our newly-acquired understanding of front-end technologies, explore Foundation’s offerings",
            "Demo: creating a small landing page using Foundation’s responsive components"
          ]
        }
      ]
    },
    {
      "name": "Project",
      "content": [
        {
          "type": "paragraph",
          "text": "Using everything that was learned through the sessions, create a personal landing page or a microsite. This project can be done alone or with a group. Your instructor will control the scope of the project, and will be guiding you throughout."
        }
      ]
    }
  ]
}