{
  "units": [
    {
      "name": "Programmation",
      "content": [
        {
          "type": "paragraph",
          "text": "Dans cette section, nous allons apprendre les bases de la programmation en construisant diverses applications terminales. Vous aurez la chance de construire une application météo de ligne de commande, un carnet d'adresses ainsi que quelques jeux de chance."
        },
        {
          "type": "list",
          "items": [
            "Mise en place de notre IDE et environnement de développement",
            "Apprendre les bases de la ligne de commande",
            "Utilisation de Git et GitHub",
            "JavaScript et JSON",
            "Introduction a NodeJS et npm",
            "Caractéristiques de ECMAScript 6",
            "Object-Oriented Programming"
          ]
        }
      ]
    },
    {
      "name": "Bases de données et développement Back-End",
      "content": [
        {
          "type": "paragraph",
          "text": "Dans cette section, nous allons nous concentrer sur la modélisation des données et de la persistance avec MySQL. Nous allons aussi pratiquer exposer les données en créant une projets API qui comprennent la mise à niveau de notre carnet d'adresses et jeux à utiliser une base de données."
        },
        {
          "type": "list",
          "items": [
            "Présentation des options de persistance des données",
            "Discussion sur SQL vs NoSQL",
            "Utilisez MySQL pour modeler le data et persistence",
            "Utilisez un ORM pour MySQL avec NodeJS",
            "Exposer les données et les fonctions d'une API REST",
            "Le déploiement d'un serveur d'API sur la plate-forme Heroku"
          ]
        }
      ]
    },
    {
      "name": "Développement Front-End",
      "content": [
        {
          "type": "paragraph",
          "text": "Après avoir appris comment créer une API pour exposer nos données et fonctions, cette section va nous faire pratiquons nos côtelettes de conception que nous obtenons dans le monde du développement front-end. En travaillant à mettre nos projets antérieurs à la monde front-end, nous allons pratiquer divers cadres et des outils tels que jQuery et ReactJS."
        },
        {
          "type": "list",
          "items": [
            "Regardez CSS et l'HTML semantique",
            "Regardez CSS3 et l'HTML5",
            "Introduction a SASS",
            "Utilisation de Grunt pour automatisez le dévelopment",
            "Utilisation de jQuery, AJAX et les API 3e partie",
            "Création d'une application d'un page avec ReactJS"
          ]
        }
      ]
    },
    {
      "name": "Sujets avancés et projet final",
      "content": [
        {
          "type": "paragraph",
          "text": "Dans cette section, vous et votre instructeur allez travailler ensemble pour déterminer des sujets avancés que vous souhaitez explorer. Vous pouvez décider d'aller plus en profondeur sur les choses que nous avons déjà vu, ou de découvrir un nouveau cadre, la langue ou la méthodologie. L'objectif est à la portée des et de créer un projet final avec ce que vous avez appris au cours de la bootcamp."
        },
        {
          "type": "paragraph",
          "text": "Certains des sujets qui peuvent être travaillées comprennent, mais ne sont pas limités à:"
        },
        {
          "type": "list",
          "items": [
            "Introduction au développement WordPress",
            "Contribuer à un projet open-source",
            "L'utilisation d'un cadre frontal différent comme Backbone ou AngularJS",
            "Exploration d'un système de base de données différent, comme MongoDB ou Cassandra",
            "Déploiement d'une application sur Amazon Web Services",
            "Essayer le développement mobile en utilisant JavaScript avec React Native",
            "Utilizez le CSS3 avancé pour crée un nouveau CSS Zen Garden (csszengarden.com)",
            "... ou toute autre chose qui pique votre curiosité et vous obtient motivé :)"
          ]
        },
        {
          "type": "paragraph",
          "text": "Le dernier jour du bootcamp, vous présenterez votre projet à vos camarades de classe, amis et famille."
        }
      ]
    }
  ]
}